Repository: zipf/perldoc-es
Catalog: tm/work/perlspanish-omegat.explorer.tmx
Source language: en_us
Languages: es_es

source: Note that C<$_> is an alias to the list value, so it can be used to modify the elements of the LIST.
es_es: Note que C<$_> es un alias al valor de la lista, por lo que puede ser usado para modificar los elementos de la LISTA.

source: C<re> upgraded to version 0.05
es_es: C<re> actualizado a la versión 0.05

source: That means that C<caller(N)> might not return information about the call frame you expect it to, for C<< N > 1 >>.
es_es: Esto significa que C<caller(N)> quizás no devuelva información sobre el marco de llamada que espera, para C<< N > 1 >>.

source: If C<use locale> is in effect and POSIX::setlocale() has been called, the character used for the decimal separator in formatted floating-point numbers is affected by the LC_NUMERIC locale setting.
es_es: Si C<use locale> está activo y POSIX::setlocale() ha sido llamada, el carácter utilizado para el separador decimal en números formateados en punto flotante se ve afectado por la configuración regional de LC_NUMERIC.

source: Perl B<borrows syntax> and concepts from many languages: awk, sed, C, Bourne Shell, Smalltalk, Lisp and even English.
es_es: Perl B<toma prestada la sintaxis> y conceptos de muchos lenguajes: awk, sed, C, Bourne Shell, Smalltalk, Lisp e incluso el Inglés.

source: There is no equivalent operator to force an expression to be interpolated in list context because in practice, this is never needed.
es_es: No hay un operador equivalente que fuerce a una expresión a ser interpolada en contexto de lista, ya que en la práctica, esto nunca es necesario.

source: See L<perlsec> for a clean and safe example of a manual fork() and exec() to emulate backticks safely.
es_es: Vea L<perlsec> para un ejemplo seguro y limpio de un fork() y exec() manual para emular comillas invertidas de forma segura.

source: or even just
es_es: o incluso sólo

source: It uses the domain to provide general support services to the Perl community, including the hosting of mailing lists, web sites, and other services.
es_es: Usa el dominio para proporcionar servicios generales de soporte a la comunidad Perl, como el alojamiento de listas de correo y sitios web, entre otros.

source: perlko Perl for Korean (in EUC-KR)
es_es: perlko Perl para coreano (en EUC-KR)

source: If the output is empty and C<$@> contains an object reference that has a C<PROPAGATE> method, that method will be called with additional file and line number parameters.
es_es: Si la salida está vacía y C<$@> contiene una referencia a un objeto que tiene un método C<PROPAGATE>, éste método será llamado con los parámetros adicionales del archivo y número de línea.

source: =head1 CONTACT
es_es: =head1 CONTACTO

source: The EXPR can be arbitrarily complicated provided its final operation is an element or slice of an aggregate:
es_es: La EXPR puede ser tan arbitrariamente complicada con tal de que el final de la operación sea un elemento o una porción de un agregado:

source: This is the internal function implementing the C<\U> escape in double-quoted strings.
es_es: Esta es la función interna del escapado C<\U> en las cadenas doblemente entrecomilladas.

source: "aa" =~ /${b}/; # True
es_es: "aa" =~ /${b}/; # Verdadero

source: Verifies your POD's correctness
es_es: Comprueba la exactitud de tu POD

source: =head2 Usage Hints for Perl on VM/ESA
es_es: =head2 Sugerencias de uso para Perl en VM/ESA

source: C upgraded to version 1.06
es_es: C actualizado a la versión 1.06

source: This is faster and more productive than just posting a request.
es_es: Esto suele ser más rápido y productivo que publicar una pregunta.

source: If there are more pack codes or if the repeat count of a field or a group is larger than what the remainder of the input string allows, the result is not well defined: the repeat count may be decreased, or C<unpack()> may produce empty strings or zeros, or it may raise an exception.
es_es: Si hay más códigos de empaquetado o si el número de repeticiones de un campo o un grupo es más grande que lo que el resto de la cadena de entrada permite, el resultado no está bien definido: el número de repeticiones puede ser disminuido, o C<unpack()> puede producir cadenas vacías o ceros, o puede provocar una excepción.

source: You can read that documentation using the C<perldoc> command or whatever method you're using to read this document.
es_es: Puede consultar la documentación mediante el comando C<perldoc> o cualquier otro método que use para leer este documento.

source: The C<exec> function executes a system command I<and never returns>; use C<system> instead of C<exec> if you want it to return.
es_es: La función C<exec> ejecuta un comando del sistema I<y nunca regresa>; use C<system> en lugar de C<exec> si quiere que regrese.

source: C<Math::Trig> upgraded to version 1.03
es_es: C<Math::Trig> actualizado a la versión 1.03

source: /(.)\g1/ # find first doubled char and print "'$1' is the first doubled character\n";
es_es: /(.)\g1/ # busca el primer carácter repetido and print "'$1' es el primer carácter repetido\n";

source: perlvmesa Perl notes for VM/ESA
es_es: perlvmesa Notas para VM/ESA

source: Six such conversions are possible:
es_es: Hay seis conversiones posibles:

source: If your platform doesn't support NaNs then NaN is just a string with numeric value 0.
es_es: Si su plataforma no es compatible con NaN entonces NaN es sólo una cadena con un valor numérico 0.

source: Bad example:
es_es: Mal ejemplo:

source: perl5005delta Perl changes in version 5.005
es_es: perl5005delta Cambios en la versión 5.005

source: perl595delta Perl changes in version 5.9.5
es_es: perl595delta Cambios en la versión 5.9.5

source: =head2 Writing subroutines
es_es: =head2 Programación de subrutinas

source: B<UTF-8> is a Unicode encoding.
es_es: B<UTF-8> es una codificación de Unicode.

source: Without this, the scalars have already been freed sufficiently at the point of detection that it is impossible to produce any meaningful dump of their contents.
es_es: Sin esto, los escalares ya habrían sido liberados, de tal manera, que se haría imposible producir cualquier descarga significativa de sus contenidos.

source: Compare the following to the examples in C<(*PRUNE)>; note the string is twice as long:
es_es: Compare lo siguiente con los ejemplos de C<(*PRUNE)>; nota que la cadena es el doble de larga:

source: That way when somebody tries to run the new code under an old perl, rather than getting an error like
es_es: De esta forma cuando alguien intente ejecutar el nuevo código en un viejo perl, en lugar de obtener un error como

source: The behavior of C<O_TRUNC> with C<O_RDONLY> is undefined.
es_es: El comportamiento de C<O_TRUNC> con C<O_RDONLY> no está definido.

source: That is, modifying an element of a list returned by grep (for example, in a C<foreach>, C<map> or another C<grep>) actually modifies the element in the original list.
es_es: Es decir, modificar un elemento de la lista devuelto por grep (por ejemplo, en un C<foreach>, C<map> u otro C<grep>) modifica el elemento en la lista original.

source: For example, C<BENGALI DIGIT FOUR> (U+09EA) looks very much like an C<ASCII DIGIT EIGHT> (U+0038).
es_es: Por ejemplo, C<BENGALI DIGIT FOUR> (U+09EA) se parece mucho a una C<ASCII DIGIT EIGHT> (U+0038).

source: C<\x{100}> and C<\o{400}> are both 256 in decimal, so the number is interpreted as a Unicode code point no matter what the native encoding is.
es_es: C<\x{100}> y C<\o{400}> son, ambos dos, 256 en decimal, por lo que el número se interpreta como un punto de código Unicode no importa qué codificación nativa sea.

source: printf '%3$d %d %1$d', 1, 2, 3; # prints "3 1 1"
es_es: printf '%3$d %d %1$d', 1, 2, 3; # imprime "3 1 1"

source: If there are multiple threads running, C<close> on a filehandle from a piped open returns true without waiting for the child process to terminate, if the filehandle is still open in another thread.
es_es: Si hay múltiples hilos en ejecución, hacer un C<close> en un identificador de archivo desde un open entubado, devuelve verdadero sin esperar a que el proceso hijo termine, si el identificador de archivo sigue abierto en otro hilo.

source: =head3 (Reminder) 5.005-style threads are deprecated (really)
es_es: =head3 (Recordatorio) los I<threads> estilo 5.005 son obsoletos (de verdad)

source: In versions of Perl prior to 5.004 the default seed was just the current C<time>.
es_es: En las versiones de Perl anteriores a 5.004 la semilla por defecto era sólo el valor actual de C<time>.

source: Updated to version 1.33
es_es: Actualizado a la versión 1.33

source: =item L<pod2html|pod2html> and L<pod2latex|pod2latex>
es_es: =item L<pod2html|pod2html> y L<pod2latex|pod2latex>

source: If you want to call the underlying C<getppid()>, you may use the CPAN module C<Linux::Pid>.
es_es: Si quiere llamar a la subyacente C<getppid()>, puede usar el módulo de CPAN C<Linux::Pid>.

source: (Duping a filehandle does not take into account any existing contents of IO buffers.) If you use the three-argument form, then you can pass either a number, the name of a filehandle, or the normal "reference to a glob".
es_es: (Duplicar un identificador de archivo no tiene en cuenta ningún contenido actual de los búfer de E/S). Si utiliza la forma de tres argumentos, entonces puede pasar un número, el nombre de un identificador de archivo o la normal "referencia a un glob".

source: =head2 XS-assisted SWASHGET
es_es: =head2 SWASHGET XS-asistida

source: (Building 'cc -n32' is the default.)
es_es: (Compilar 'cc -n32' está por defecto)

source: Similarly, if the specified Perl version is greater than or equal to 5.11.0, strictures are enabled lexically as with C<use strict> (except that the F<strict.pm> file is not actually loaded).
es_es: Del mismo modo, si la versión especificada de Perl es mayor o igual a 5.11.0, el modo de trabajo estricto quedará activado léxicamente como con C<use strict> (excepto que el archivo F<strict.pm>, realmente, no se cargará).

source: This can gain you a measure of efficiency if you know the hash is going to get big.
es_es: Puede hacerle ganar más eficiencia si sabe que el hash va a tener un gran tamaño.

source: It's important to realize that there are no bytes in a text string.
es_es: Es importante comprender que en una cadena de texto no hay bytes.

source: You can't have a filehandle named "log", for instance.
es_es: No se puede tener un identificador de archivo llamado "log", por ejemplo.

source: The syntaxes
es_es: La sintaxis

source: vec($image, $max_x * $x + $y, 8) = 3;
es_es: vec($imagen, $max_x * $x + $y, 8) = 3;

source: perl594delta - what is new for perl v5.9.4
es_es: perl594delta - qué hay de nuevo para perl v5.9.4

source: DBM Filters are useful for a class of problems where you I<always> want to make the same transformation to all keys, all values or both.
es_es: Los filtros DBM son útiles para un tipo de problema en el que se desea aplicar I<siempre> la misma transformación a todas las claves, a todos los valores, o a todas las claves y todos los valores.

source: Or you can see this document by entering "perldoc perlartistic"
es_es: O puede ver este documento mediante la introducción de "perldoc perlartistic"

source: If EXPR is C<... || ...>, C<... // ...> or C<... or ...>, the test is applied recursively to the first operand (which may be a higher-precedence AND operator, for example).
es_es: Si EXPR es C<... || ...>, C<... // ...> o C<... or ...>, el test se aplica recursivamente al primer operando (que puede ser un operador de mayor precedencia, como el AND, por ejemplo).

source: There are a number of Unicode characters that match multiple characters under C</i>.
es_es: Hay una serie de caracteres Unicode que coinciden con múltiples caracteres con C</i> activado.

source: This means that the curly brackets are I<required>--no dangling statements allowed.
es_es: Esto significa que las llaves son I<necesarias>: no se permiten instrucciones sueltas.

source: Modifying the target string also resets the search position.
es_es: Modificando la cadena objetivo también restablece la posición de búsqueda.

source: Normally, when accepting literal string input from the user, quotemeta() or C<\Q> must be used.
es_es: Normalmente, quotemeta() o C<\Q> deben ser usados al aceptar cadenas de entrada provenientes del usuario.

source: embeddable and extensible
es_es: capacidad de integración y ampliación

source: sub read_myfile_munged {
es_es: sub leer_miarchivo {

source: perl5134delta Perl changes in version 5.13.4
es_es: perl5134delta Cambios en la versión 5.13.4

source: POSITION before the beginning of the string or after its end is treated as if it were the beginning or the end, respectively.
es_es: POSICIÓN antes del comienzo del string o después de su final es tratado como si estuviera al principio o al final, respectivamente.

source: (The epoch was at 00:00 January 1, 1970 GMT.)
es_es: (El epoch fue a las 00:00 GMT del 1 de enero de 1970)

source: printf '<%-6s>', 12; # prints "<12 >"
es_es: printf '<%-6s>', 12; # imprime "<12 >"

source: The terminating string may be either an identifier (a word), or some quoted text.
es_es: La cadena de terminación puede ser un identificador (una palabra), o algún texto entrecomillado.

source: Extensive reworking of the pad code (the code responsible for lexical variables) has been conducted by Dave Mitchell.
es_es: Una remodelación extensa del código de control (el código responsable de las variables léxicas) ha sido llevado a cabo por Dave Mitchell.

source: C<Archive::Tar> is a module to manipulate C<tar> archives.
es_es: C<Archive::Tar> es un módulo para manipular archivos C<tar>.

# $verbose && print "Starting analysis ";
source: $verbose && print "Starting analysis\n";
es_es: $locuaz && print "Empezando análisis\n";

source: one may need to use the template C<c x![d] d c[2]>.
es_es: puede tener que usar la plantilla C<c x![d] d c[2]>.

source: # Match a minimal number of characters.
es_es: # Busca el mínimo número de caracteres.

source: You should instead use a simple test for size:
es_es: Utilize en su lugar una comprobación de tamaño:

source: In list context, returns the elements removed from the array.
es_es: En contexto lista, devuelve los elementos retirados del array.

source: The $passwd and $shell, user's encrypted password and login shell, are also tainted, for the same reason.
es_es: La $contrasena y el $shell, la contraseña codificada del usuario y el shell del login, están también contaminados, por la misma razón.

source: Even C<< <$x > >> (note the extra space) is treated as C<glob("$x ")>, not C<readline($x)>.
es_es: Incluso C<< <$x > >> (note el espacio extra) es tratado como C<glob("$x ")>, no como C<readline($x)>.

source: TIEHASH classname, LIST
es_es: TIEHASH clase, LISTA

source: Space around most operators.
es_es: Espacio alrededor de la mayoría de operadores.

source: See "DTrace support" in F<INSTALL>.
es_es: Vea "Soporte DTrace" en F<INSTALL>.

source: See the L<perlbook> documentation or ( http://books.perl.org ).
es_es: Consulte el documento L<perlbook> o visite http://books.perl.org para obtener más información.

source: our $bar; # emits warning but has no other effect
es_es: our $bar; # emite una advertencia pero no tiene otro efecto

source: -r File is readable by effective uid/gid.
es_es: -r Archivo es legible por el uid/gid en vigor.

source: \S [3] Match a non-whitespace character
es_es: \S [3] Coincide con un carácter que no es un espacio en blanco

source: Thanks!
es_es: Se lo agradeceremos...

source: F<perlbug> is the recommended way to report bugs in the perl interpreter itself or any of the standard library modules back to the developers; please read through the documentation for F<perlbug> thoroughly before using it to submit a bug report.
es_es: La manera recomendada de notificar errores del intérprete perl o de cualquier módulo de la biblioteca estándar a sus programadores es usar F<perlbug>; pero antes de usar F<perlbug> debe leer con atención su documentación.

source: See L</pack> for more examples and notes.
es_es: Ver L</pack> para más ejemplos y notas.

source: For a yet-more-powerful import facility, see L</use> and L<perlmod>.
es_es: Para una más-que-poderosa facilidad de importación, ver L</use> y L<perlmod>.

source: =item use Module
es_es: =item use Módule

source: Many people think that Unicode and UTF-8 are the same thing, but they're not.
es_es: Muchas personas creen que Unicode es lo mismo que UTF-8, pero se equivocan.

source: The return value of C<ioctl> (and C<fcntl>) is as follows:
es_es: El valor devuelto de C<ioctl> (y C<fcntl>) es como sigue:

source: I<Operator associativity> defines what happens if a sequence of the same operators is used one after another: whether the evaluator will evaluate the left operations first or the right.
es_es: I<Asociatividad de operadores> define qué sucede si una secuencia de los mismos operadores es usada una detrás de otra: si el evaluador evaluará primero las operaciones a la izquierda o las de la derecha.

source: Alternatively, put this as the first line of your script:
es_es: Como alternativa, puede colocar al principio del script la siguiente línea:

source: The S-magic avoids dropping the caching optimization and making (??{...}) constructs obscenely slow (and consequently useless).
es_es: El S-magic evita decaer la optimización de almacenamiento en caché y que las construcciones (??{...}) sean obscenamente lentas (y por lo tanto, inútiles).

source: Calls the System V IPC function msgctl(2).
es_es: Llama a la función System V IPC msgctl(2).

source: A declaration can be put anywhere a statement can, but has no effect on the execution of the primary sequence of statements--declarations all take effect at compile time.
es_es: Una declaración puede ponerse en cualquier sitio, como si fuera una instrucción, pero no tiene efecto en la ejecución de la secuencia de instrucciones principal: todas las declaraciones toman efecto en tiempo de compilación.

source: There's no place to declare a scalar variable to be of type "string", type "number", type "reference", or anything else.
es_es: No hay ninguna forma de declarar que una variable escalar sea de tipo "cadena", tipo "número", tipo "referencia" o de cualquier otro.

source: That is, an opening parenthesis after the operator does not affect how much of the following code constitutes the argument.
es_es: Es decir, un paréntesis de apertura después del operador no influye en que el código que sigue se constituya como el argumento.

source: # this is where that last takes me
es_es: # Aquí es donde lleva el 'last'

source: Non-blocking wait is available on machines supporting either the waitpid(2) or wait4(2) syscalls.
es_es: Espera no bloqueanto está disponible en máquinas que soporten las llamadas del sistema, tanto waitpid(2) como wait4(2).

source: However, if you get into the habit of doing that, you get yourself into trouble if you then add an C</e> modifier.
es_es: Sin embargo, si usted entra en el hábito de hacer eso, se mete en problemas si, a continuación, añade un modificador C</e>.

source: (this may not work on some bizarre filesystems).
es_es: (esto quizás no funcione en algunos sistemas de archivos extraños).

source: $string =~ /$re/;
es_es: $cadena =~ /$re/;

source: =head1 Installation and Configuration Improvements
es_es: =head1 Mejoras en la instalación y configuración

source: There is also a Usenet gateway to Perl mailing lists sponsored by perl.org at nntp://nntp.perl.org , a web interface to the same lists at http://nntp.perl.org/group/ and these lists are also available under the C<perl.*> hierarchy at http://groups.google.com . Other groups are listed at http://lists.perl.org/ ( also known as http://lists.cpan.org/ ).
es_es: También existe una pasarela Usenet a las listas de correo de Perl patrocinada por perl.org en nntp://nntp.perl.org y una interfaz web a las mismas listas en http://nntp.perl.org/group/. Estas listas también están disponibles en la jerarquía C<perl.*> de http://groups.google.com . En la dirección http://lists.perl.org/ ( conocida también como http://lists.cpan.org/ ) se indican otros grupos.

source: As of 5.005, C<$&> is not so costly as the other two.
es_es: A partir de 5.005, C<$&> no es tan costoso como los otros dos.

source: $days{'Feb'} # the 'Feb' value from hash %days
es_es: $dias{'Feb'} # el valor 'Feb' del hash %dias

source: On simple groups, such as the pattern C<< (?> [^()]+ ) >>, a comparable effect may be achieved by negative look-ahead, as in C<[^()]+ (?!
es_es: En grupos sencillos, como en el patrón C<< (?> [^()]+ ) >>, un efecto comparable puede ser conseguido por medio de una aserción antecedente, como en C<[^()]+ (?!

source: @contact = sort { $a cmp $b } find_records @key;
es_es: @contacto = sort { $a cmp $b } busca_registros @claves;

source: This ease of experimentation flattens the learning curve even more.
es_es: Esta facilidad para realizar experimentos también allana la curva de aprendizaje.

source: Works just like L<localtime> but the returned values are localized for the standard Greenwich time zone.
es_es: Funciona igual que L<localtime> pero los valores devueltos son localizados por la zona horaria estándar de Greenwich.

source: %o an unsigned integer, in octal
es_es: %o un entero sin signo, en octal

source: chomp($word = <STDIN>);
es_es: chomp($palabra = <STDIN>);

source: For "g" and "G", this specifies the maximum number of digits to show, including thoe prior to the decimal point and those after it; for example:
es_es: Para "g" y "G", especifica el número máximo de dígitos para mostrar, incluyendo los anteriores del punto decimal y los posteriores a él, por ejemplo:

source: Note also that, due to the implementation of C<use filetest 'access'>, the C<_> special filehandle won't cache the results of the file tests when this pragma is in effect.
es_es: Note también que, debido a la implementación de C<use filetest 'access'>, el identificador de archivo especial C<_> no almacenará los resultados de los test de archivo mientras este pragma esté activo.

source: You should C<use Socket> first to get the proper definitions imported.
es_es: Debe usar C<use Socket> primero para obtener las apropiadas definiciones.

source: C<cond_wait> has a new two argument form.
es_es: C<cond_wait> tiene una nueva forma de dos argumentos.

source: left =~ !~
es_es: izquierda =~ !~

source: If "/" is the delimiter then the initial C<m> is optional.
es_es: Si "/" es el delimitador entonces la inicial C<m> es opcional.

# $a .= " "; # same as $a = $a . " ";
source: $a .= "\n"; # same as $a = $a . "\n";
es_es: $a .= "\n"; # igual que $a = $a . "\n";

source: When a function returns an undefined value, it's an admission that it couldn't give you an honest answer.
es_es: Cuando una función devuelve un valor indefinido, se asume que no puede dar una respuesta honrada.

source: Or with rationals:
es_es: O con números racionales:

source: Because these are not part of the standard distribution, they may and in fact do differ from the base perl port in a variety of ways.
es_es: Como no forman parte de la distribución estándar, es posible que existan diferencias (de hecho, existen) con respecto a la versión básica de perl en diversos aspectos.

source: As well as these two, there are two other converters: F<pod2html> will produce HTML pages from POD, and F<pod2latex>, which produces LaTeX files.
es_es: Hay otros dos conversores: F<pod2html> genera páginas HTML a partir de POD y F<pod2latex> genera archivos LaTeX.

source: But:
es_es: Pero:

source: 6 rdev 6 weekday 6 evaltext $@ eval error
es_es: 6 rdev 6 día semana 6 evaltext $@ error eval
